<?php

use App\Enums\MediaType;
use App\Enums\PriceType;
use Illuminate\Database\Seeder;
use App\Repositories\NodeRepository;

class NodesTableSeeder extends Seeder
{

    private $node_repo;

    public function __construct(NodeRepository $node)
    {
        $this->node_repo = $node;
    }

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $node = $this->node_repo;
        $root = $node->create([
            'title' => 'پکیج آموزش زبان',
            'description' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        ]);
        $child1 = $root->children()->create(['title' => 'آموزش خردسال', 'description' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',]);

        $child2 = $root->children()->create(['title' => 'آموزش بین ۵ تا ۷', 'description' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',]);

        $child3 = $root->children()->create(['title' => 'آموزش بین ۷ تا ۱۰', 'description' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',]);

        $child4 = $root->children()->create(['title' => 'آموزش بین ۱۰ تا ۱۲', 'description' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',]);

        $root->images()->create([
            'path' => 'uploads/200.jpeg',
            'size' => '250000',
        ], ['type' => MediaType::IMAGE]);

        $root->images()->create([
            'path' => 'uploads/200.jpeg',
            'size' => '250000',
        ], ['type' => MediaType::IMAGE]);

        $root->prices()->createMany([
            ['amount' => '400000', 'type' => PriceType::CASH],
            ['amount' => '1000', 'type' => PriceType::COIN],
        ]);

        $child1->images()->create([
            'path' => 'uploads/200.jpeg',
            'size' => '250000',
        ], ['type' => MediaType::IMAGE]);

        $child1->images()->create([
            'path' => 'uploads/c7b9a9ef2840fd867824c47320e91ca519766824-144p__50631.mp4',
            'size' => '854',
            'duration' => "1:13"
        ], ['type' => MediaType::VIDEO]);

        $child1->images()->create([
            'path' => 'uploads/AvanBand-CTo-320(www.Next1.ir).mp3',
            'size' => '78526',
            'duration' => "3:04"
        ], ['type' => MediaType::VOICE]);

        $child1->prices()->createMany([
            ['amount' => '100000', 'type' => PriceType::CASH],
            ['amount' => '250', 'type' => PriceType::COIN],
        ]);

        $child2->images()->create([
            'path' => 'uploads/200.jpeg',
            'size' => '250000',
        ], ['type' => MediaType::IMAGE]);

        $child2->images()->create([
            'path' => 'uploads/c7b9a9ef2840fd867824c47320e91ca519766824-144p__50631.mp4',
            'size' => '854',
            'duration' => "1:13"
        ], ['type' => MediaType::VIDEO]);

        $child2->prices()->createMany([
            ['amount' => '100000', 'type' => PriceType::CASH],
            ['amount' => '250', 'type' => PriceType::COIN],
        ]);

        $child3->images()->create([
            'path' => 'uploads/c7b9a9ef2840fd867824c47320e91ca519766824-144p__50631.mp4',
            'size' => '854',
            'duration' => "1:13"
        ], ['type' => MediaType::VIDEO]);

        $child3->images()->create([
            'path' => 'uploads/AvanBand-CTo-320(www.Next1.ir).mp3',
            'size' => '78526',
            'duration' => "3:04"
        ], ['type' => MediaType::VOICE]);

        $child3->prices()->createMany([
            ['amount' => '100000', 'type' => PriceType::CASH],
            ['amount' => '250', 'type' => PriceType::COIN],
        ]);

        $child4->images()->create([
            'path' => 'uploads/c7b9a9ef2840fd867824c47320e91ca519766824-144p__50631.mp4',
            'size' => '854',
            'duration' => "1:13"
        ], ['type' => MediaType::VIDEO]);

        $child4->prices()->createMany([
            ['amount' => '100000', 'type' => PriceType::CASH],
            ['amount' => '250', 'type' => PriceType::COIN],
        ]);
    }
}
